* Import `pandas` and name as alias `pd`

In [338]:
import pandas as pd

* Created a new variable `job_df` and set it equal to the imported file `job_per_year.csv`

In [339]:
job_df = pd.read_csv('job_per_year.csv')
job_df.head()

         DATE  IPUTN722511W200000000
0  1987-01-01                 2938.8
1  1988-01-01                 3033.8
2  1989-01-01                 3111.0
3  1990-01-01                 3171.5
4  1991-01-01                 3158.4

* Renamed column(s) `IPUTN722511W200000000` and `DATE` to `jobs in K` and `year` to make compatable for joining other .csv files

In [340]:
renamed_to_jobs = job_df.rename(columns={"IPUTN722511W200000000": "jobs in k",
                                         "DATE":"year"})
renamed_to_jobs.head()

         year  jobs in k
0  1987-01-01     2938.8
1  1988-01-01     3033.8
2  1989-01-01     3111.0
3  1990-01-01     3171.5
4  1991-01-01     3158.4

* Created new column to change data in thousands to millions

In [341]:
renamed_to_jobs["jobs millions"]= renamed_to_jobs["jobs in k"] * 0.001

renamed_to_jobs.head()

         year  jobs in k  jobs millions
0  1987-01-01     2938.8         2.9388
1  1988-01-01     3033.8         3.0338
2  1989-01-01     3111.0         3.1110
3  1990-01-01     3171.5         3.1715
4  1991-01-01     3158.4         3.1584

* Converting  `jobs millions` datatype to string in order to limit the decimal points and renaming column `job in millions`

In [342]:
renamed_to_jobs["job in millions"] = renamed_to_jobs["jobs millions"].astype(str).str[0:4]
renamed_to_jobs.head()

         year  jobs in k  jobs millions job in millions
0  1987-01-01     2938.8         2.9388            2.93
1  1988-01-01     3033.8         3.0338            3.03
2  1989-01-01     3111.0         3.1110            3.11
3  1990-01-01     3171.5         3.1715            3.17
4  1991-01-01     3158.4         3.1584            3.15

* Converting `job in millions` column value datatypes to float64 and renaming to `jobs in millions` for easier use in future tableau visulizations

In [343]:
renamed_to_jobs["jobs in millions"] = renamed_to_jobs["job in millions"].astype(float)
renamed_to_jobs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   year              35 non-null     object
 1   jobs in k         35 non-null     float64
 2   jobs millions     35 non-null     float64
 3   job in millions   35 non-null     object
 4   jobs in millions  35 non-null     float64
dtypes: float64(3), object(2)
memory usage: 1.5+ KB

* Dropped `jobs millions` column to clean unwanted data

In [344]:
dropped_jobs_column_df = renamed_to_jobs.drop(["jobs millions"], axis=1)
dropped_jobs_column_df.head()

         year  jobs in k job in millions  jobs in millions
0  1987-01-01     2938.8            2.93              2.93
1  1988-01-01     3033.8            3.03              3.03
2  1989-01-01     3111.0            3.11              3.11
3  1990-01-01     3171.5            3.17              3.17
4  1991-01-01     3158.4            3.15              3.15

* Dropped `job in millions` column to clean unwanted data type

In [345]:
dropped_job_in_column_df = dropped_jobs_column_df.drop(["job in millions"], axis=1)
dropped_job_in_column_df.head()

         year  jobs in k  jobs in millions
0  1987-01-01     2938.8              2.93
1  1988-01-01     3033.8              3.03
2  1989-01-01     3111.0              3.11
3  1990-01-01     3171.5              3.17
4  1991-01-01     3158.4              3.15

* Dropped `jobs in k` column to clean unwanted data

In [346]:
dropped_k_col_df = dropped_job_in_column_df.drop(["jobs in k"], axis=1)
dropped_k_col_df.head()

         year  jobs in millions
0  1987-01-01              2.93
1  1988-01-01              3.03
2  1989-01-01              3.11
3  1990-01-01              3.17
4  1991-01-01              3.15

* Renamed `dropped_col_df` to `new_df` for cleaner future coding

In [347]:
new_df = dropped_k_col_df
new_df.head()

         year  jobs in millions
0  1987-01-01              2.93
1  1988-01-01              3.03
2  1989-01-01              3.11
3  1990-01-01              3.17
4  1991-01-01              3.15

* Changed `datatype` of `year` column to `datetime64[ns]`

In [348]:
new_df["year"] = pd.to_datetime(new_df["year"])
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   year              35 non-null     datetime64[ns]
 1   jobs in millions  35 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 688.0 bytes

* Specified the four digit year only for data in `year` column

In [349]:
new_df["year"] = new_df["year"].dt.strftime('%Y')
new_df.head()

   year  jobs in millions
0  1987              2.93
1  1988              3.03
2  1989              3.11
3  1990              3.17
4  1991              3.15

* Converted cleaned data frame to `clean_job_year.csv` file and exported.

In [350]:
new_df.to_csv("clean_job_year.csv", encoding="utf-8", index=False)